Exercise problems:

read the data from given url to DataFrame as sales_data
https://raw.githubusercontent.com/svkarthik86/Assignment/main/Sales_Data/Sales_January_2019.csv

Q1.Rename The column name with valid format:
    oldname:Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
    newname:Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address
    
Q2.insert new column as order_price  
compute order_price =Price_Each*Quantity_Ordered

Q3.Delete the column Purchase_Address 

Q4.insert new row data as  at last
100001,OnePhone,1,600, 01/22/19 21:25,600

In [2]:
import pandas as pd
sales_data=pd.read_csv("https://raw.githubusercontent.com/svkarthik86/Assignment/main/Sales_Data/Sales_January_2019.csv")
sales_data.head()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,141234,iPhone,1,700,01/22/19 21:25,"944 Walnut St, Boston, MA 02215"
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,"185 Maple St, Portland, OR 97035"
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,"538 Adams St, San Francisco, CA 94016"
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,"738 10th St, Los Angeles, CA 90001"
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,"387 10th St, Austin, TX 73301"

In [7]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9723 entries, 0 to 9722
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order_ID          9697 non-null   object
 1   Product           9697 non-null   object
 2   Quantity_Ordered  9697 non-null   object
 3   Price_Each        9697 non-null   object
 4   Order_Date        9697 non-null   object
 5   Purchase_Address  9697 non-null   object
dtypes: object(6)
memory usage: 455.9+ KB

# Q1.Rename The column name with valid format:
    oldname:Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
    newname:Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,Purchase_Address

In [8]:
sales_data.columns

Index(['Order_ID', 'Product', 'Quantity_Ordered', 'Price_Each', 'Order_Date',
       'Purchase_Address'],
      dtype='object')

In [9]:
sales_data.columns=sales_data.columns.str.replace(" ","_")

In [10]:
sales_data.columns

Index(['Order_ID', 'Product', 'Quantity_Ordered', 'Price_Each', 'Order_Date',
       'Purchase_Address'],
      dtype='object')

# Q2.insert new column as order_price  
compute order_price =Price_Each*Quantity_Ordered

In [6]:
sales_data.Price_Each.isna()     #to find the missing value

0       False
1       False
2       False
3       False
4       False
        ...
9718    False
9719    False
9720    False
9721    False
9722    False
Name: Price_Each, Length: 9723, dtype: bool

In [130]:
sales_data.Price_Each.isna().count()

9723

In [131]:
sales_data.Quantity_Ordered.isna().count()

9723

In [11]:
sales_data=sales_data[~(sales_data.Price_Each.isna())] #cleaned data # remoned nansales_data=sales_data[~(sales_data.Price_Each.isna())] #cleaned data # remoned nan

In [12]:
sales_data=sales_data[~(sales_data.Quantity_Ordered.isna())]

In [13]:
sales_data=sales_data[~(sales_data['Price_Each']=='Price Each')]

In [136]:
sales_data["Price_Each"].dtype

dtype('O')

In [14]:
sales_data["order_price"]=sales_data.loc[:,"Price_Each"].astype("float")*sales_data.loc[:,"Quantity_Ordered"].astype("float")

In [15]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9681 entries, 0 to 9722
Data columns (total 7 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order_ID          9681 non-null   object
 1   Product           9681 non-null   object
 2   Quantity_Ordered  9681 non-null   object
 3   Price_Each        9681 non-null   object
 4   Order_Date        9681 non-null   object
 5   Purchase_Address  9681 non-null   object
 6   order_price       9681 non-null   float64
dtypes: float64(1), object(6)
memory usage: 605.1+ KB

# Q3.Delete the column Purchase_Address

In [114]:
del sales_data["Purchase_Address"]

In [115]:
sales_data.head()

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date
0,141234,iPhone,1,700,01/22/19 21:25
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15
2,141236,Wired Headphones,2,11.99,01/17/19 13:33
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33
4,141238,Wired Headphones,1,11.99,01/25/19 11:59

# Q4.insert new row data as  at last
100001,OnePhone,1,600, 01/22/19 21:25,600

In [76]:
sales_data.append({"Order_ID":100001,"Product":"OnePhone","Quantity_Ordered":1,"Price_Each":600,"Order_Date":"01/22/19 21:25","order_price":600},ignore_index=True)

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,order_price
0,141234,iPhone,1,700,01/22/19 21:25,700.00
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,14.95
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,23.98
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,149.99
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,11.99
5,100001,OnePhone,1,600,01/22/19 21:25,600.00

In [74]:
sales_data

,Order_ID,Product,Quantity_Ordered,Price_Each,Order_Date,order_price
0,141234,iPhone,1,700,01/22/19 21:25,700.00
1,141235,Lightning Charging Cable,1,14.95,01/28/19 14:15,14.95
2,141236,Wired Headphones,2,11.99,01/17/19 13:33,23.98
3,141237,27in FHD Monitor,1,149.99,01/05/19 20:33,149.99
4,141238,Wired Headphones,1,11.99,01/25/19 11:59,11.99